{
  "users": [
    {
      "id": "001",
      "login": "anton",
      "password": "qwerty123",
      "registered_at": "2077-09-22",
      "role_id": 0
    },
    {
      "login": "ivan",
      "password": "qwe123",
      "registered_at": "2058-12-21",
      "role_id": 2,
      "id": "MSdHjuQ"
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Модератор"
    },
    {
      "id": 2,
      "name": "Читатель"
    },
    {
      "id": 3,
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Что такое Манхва?",
      "image_url": "https://fastly.picsum.photos/id/339/280/150.jpg?hmac=pkO9jvwSfA6EbwwAkiuZ_LJHgveIIaS-gD83I7iyY3E",
      "content": "Манхва - это южнокорейский аналог японской манги, представляющий собой графические романы или комиксы. Этот жанр искусства и развлечения набирает все большую популярность как на внутреннем рынке Южной Кореи, так и за её пределами. Манхва объединяет в себе богатую палитру стилей, жанров и тематик, что делает его привлекательным для широкой аудитории.<br/>Важной чертой манхвы является разнообразие жанров. Здесь можно найти практически все: от романтики, фэнтези, научной фантастики и драмы до ужасов, боевиков и комедийных историй. Благодаря такому разнообразию читатели могут выбирать произведения в соответствии с их вкусами и интересами.<br/>Один из заметных аспектов манхвы - это визуальный стиль и художественное оформление. Художники и авторы манхвы часто используют насыщенные цвета, детализированные фоны и выразительные персонажи. Это позволяет легче погрузиться в мир рассказа и визуально увлекаться сюжетом.<br/>С развитием цифровых технологий манхва стала доступна онлайн, что позволило ей привлечь глобальную аудиторию. Онлайн-платформы позволяют авторам и художникам самостоятельно публиковать свои работы без посредников, что способствует большей творческой свободе и разнообразию контента.<br/>Таким образом, манхва - это не только популярная развлекательная форма искусства, но и средство самовыражения для множества талантливых художников и авторов. Её богатство жанров и стилей, визуальная привлекательность и доступность сделали манхву значимым элементом современной поп-культуры как в Южной Корее, так и в мире.",
      "published_at": "2077-01-01"
    },
    {
      "id": "002",
      "title": "Что такое Манга?",
      "image_url": "https://fastly.picsum.photos/id/703/280/150.jpg?hmac=Q2vnPlWhuJikmPO03FbRuU9YgUs3dPQihKYMmI3i0yQ",
      "content": "Манга - это японский жанр комиксов или графических романов, который занимает особое место в мировой поп-культуре. Восходя своими корнями в историческое прошлое, манга сегодня является одним из самых узнаваемых и популярных элементов японской культуры. <br/>Одной из характерных черт манги является её многообразие жанров. От фэнтези и научной фантастики до романтики, драмы и ужасов - манга охватывает практически каждый аспект человеческой жизни. Это позволяет ей привлекать аудиторию всех возрастов и интересов. <br/>Стиль рисования в манге может варьироваться от очень реалистичного до карикатурного, что позволяет художникам выразить разнообразные эмоции и атмосферу. Характерные черты персонажей, динамичные позы и внимание к деталям делают мангу узнаваемой и уникальной. <br/>Мировая популярность манги неуклонно растет. Она вдохновляет создание аниме-адаптаций, фильмов, игр и других форм искусства. Онлайн-платформы также способствуют распространению манги в масштабах мирового сообщества, позволяя фанатам из разных стран наслаждаться японскими историями.<br/>Таким образом, манга - это не только форма развлечения, но и средство передачи идей, эмоций и культурных аспектов. Её влияние ощущается в разных уголках планеты, делая мангу важным компонентом глобальной поп-культуры.",
      "published_at": "2077-05-13"
    },
    {
      "id": "003",
      "title": "Что такое Манихуа?",
      "image_url": "https://fastly.picsum.photos/id/1029/280/150.jpg?hmac=UTqBJddH-kQhvy69L1dm1PJgaflmPc0RGMh7GeSBz1g",
      "content": "Манихуа - это китайский жанр графических романов, который аналогичен японской манге и южнокорейской манхве. Этот жанр комиксов получил свое имя от слова манхуа, которое на китайском языке означает несколько изображений. Манихуа представляет собой разнообразные истории, рассказанные через комбинацию текста и изображений.<br/>Подобно другим азиатским жанрам комиксов, манихуа охватывает широкий спектр жанров и тематик. От фэнтези и романтики до боевиков, исторических драм и научной фантастики - манихуа предлагает читателям разнообразие вкусов и интересов. Этот жанр также известен своими искусственно стилизованными изображениями персонажей и детализированными фонами.<br/>Онлайн-платформы играют ключевую роль в распространении манихуа, подобно тому, как они влияют на распространение манги и манхвы. Благодаря интернету, авторы и художники могут легко делиться своими работами с аудиторией и получать обратную связь. Это также способствует появлению большего разнообразия контента и поддерживает творческое разнообразие.<br/>Манихуа, как и другие формы комиксов, служит как источник развлечения, так и средство для выражения идей и эмоций. Его популярность продолжает расти как внутри Китая, так и за его пределами, и оказывает значительное влияние на азиатскую поп-культуру и за её пределами.",
      "published_at": "2077-05-05"
    },
    {
      "id": "004",
      "title": "Как правильно читать Мангу?",
      "image_url": "https://fastly.picsum.photos/id/522/280/150.jpg?hmac=_p7Q5Ert531mat_rpM6__ITz1wlehkKsavFFGhoNs4Q",
      "content": "Чтение манги - это особое и увлекательное искусство, требующее некоторой практики и понимания особенностей этого формата. Вот несколько советов о том, как правильно и наслаждаться процессом чтения манги:<br/>1. **Начните с выбора жанра и заголовка:** Манга включает в себя широкий спектр жанров, от романтики до фэнтези, научной фантастики и мистики. Поэтому начните с выбора жанра, который вам интересен. Выберите заголовок, который привлекает ваше внимание, либо по рекомендациям, либо с помощью обложек и аннотаций.<br/>2. **Правильное чтение панелей:** В манге страницы часто делятся на панели, содержащие изображения и диалоги. Читайте панели слева направо, как в английском тексте, если вы читаете на английском. Затем переходите на следующую строку панелей сверху вниз. Этот порядок помогает сохранить логику сюжета.<br/>3. **Внимательно следите за выражениями лиц:** Многие эмоции и нюансы сюжета манги передаются через выражения лиц персонажей. Обращайте внимание на детали, такие как глаза, рот и мимика, чтобы лучше понимать, что персонажи чувствуют и как развивается сюжет.<br/>4. **Читайте диалоги и текст:** Важные детали сюжета и характеров могут быть раскрыты через диалоги и текстовые блоки. Не бойтесь возвращаться к предыдущим страницам, если что-то непонятно или требует уточнения. При чтении на другом языке, обратите внимание на сноски или переводческие заметки, которые могут пояснить культурные или лингвистические нюансы.<br/>5. **Наслаждайтесь искусством:** Манга - это не только сюжет, но и художественное произведение. Обратите внимание на стиль рисования, детали фона и оформление страниц. Некоторые манга могут использовать свой художественный стиль, чтобы передать настроение или эмоции.<br/>Чтение манги - это уникальный опыт, который позволяет погрузиться в разнообразные миры и истории. Следуя этим советам, вы сможете максимально насладиться этим жанром и погрузиться в его увлекательный мир.",
      "published_at": "2077-04-05"
    },
    {
      "id": "005",
      "title": "В чём отличие манги от манхвы?",
      "image_url": "https://fastly.picsum.photos/id/694/280/150.jpg?hmac=9dxhczzKbZ6D6-17dt0aKhchmT5sy6b0ZLnEYucNlQ4",
      "content": "Манга и манхва - это два разных жанра графических романов, происходящих из разных стран и имеющих некоторые отличия как в структуре, так и в стиле:<br/>Происхождение и страна: Одно из основных отличий между мангой и манхвой - это их происхождение. Манга является японским жанром, в то время как манхва - южнокорейским. Это важное различие определяет культурные, исторические и художественные аспекты каждого жанра.<br/>Стиль и художественное оформление: Манга и манхва имеют свои уникальные стили рисования. Манга часто выделяется более анимированными и стилизованными персонажами, акцентом на глазах и выразительной мимике. Манхва, с другой стороны, может быть более реалистичной и детализированной, с более натуральными пропорциями.<br/>Сюжетные особенности: Оба жанра охватывают разнообразные жанры и темы, но есть определенные сюжетные стереотипы, характерные для каждого из них. Манга может обладать более сложными и многогранными сюжетами с фокусом на персонажах и их эмоциональном развитии. Манхва, с другой стороны, иногда может иметь более быстрый сюжетный ход и больше акцента на динамичных боевых сценах.<br/>Исторический контекст и влияние: Манга имеет более долгую историю, начиная с вековых традиций японских рисунков и иллюстраций. Она оказала значительное влияние на японскую поп-культуру и даже стала предметом интереса за границей. Манхва, в свою очередь, более новая форма искусства, но также начинает активно влиять на глобальную популярность корейской культуры.<br/>Каждый из этих жанров имеет свои уникальные характеристики и привлекательные черты, делая мангу и манхву важными компонентами культурного наследия Японии и Южной Кореи соответственно.",
      "published_at": "2077-07-01"
    },
    {
      "id": "006",
      "title": "Почему манхва читается просто, а манга по особенному?",
      "image_url": "https://fastly.picsum.photos/id/20/280/150.jpg?hmac=8FQSH0ksnd3x4g-PjiHBFOdRBn4A2YFzTfzIUaAxtFI",
      "content": "Манхва и манга, несмотря на то, что оба жанра графических романов, могут вызывать различные впечатления при чтении из-за своих структурных и художественных особенностей.<br/>Чтение манхвы: Манхва, южнокорейский жанр, часто отличается более простой структурой страниц и более удобным для чтения направлением слева направо, также как и в английском тексте. Это делает манхву более доступной для аудитории, которая привыкла к левостороннему чтению. Также характерно, что манхва может обладать более детализированными и фотореалистичными изображениями персонажей и фонов.<br/>Чтение манги: Манга, японский жанр, имеет свои особенности в структуре и направлении чтения. Она читается справа налево, начиная с правой верхней части страницы, и двигается к левому нижнему углу. Это может быть немного необычным для тех, кто не привык к такому направлению. Сюжетная структура манги также может быть более интригующей и сложной, требующей внимательного анализа, чтобы полностью погрузиться в историю и понять разнообразные аспекты сюжета и персонажей.<br/>Выразительные средства: Оба жанра обладают выразительностью, но манга может более ярко передавать эмоции и атмосферу через стилизованные персонажи, выразительные глаза и панели. Манхва, с другой стороны, может акцентировать внимание на детализации и более фотореалистичных чертах.<br/>Культурные и стилистические различия: Манга и манхва также могут различаться в культурных нюансах и стилевых предпочтениях. Манга часто ориентирована на более широкий мировой рынок, в то время как манхва может содержать уникальные аспекты корейской культуры.<br/>Каждый из этих жанров имеет свой характер и чарующие черты, и выбор, что читать, зависит от ваших вкусов и предпочтений.",
      "published_at": "2077-01-02"
    },
    {
      "id": "007",
      "title": "Почему азиатские графические романы захватили мир?",
      "image_url": "https://fastly.picsum.photos/id/620/280/150.jpg?hmac=jz5p_gP9GMmcN7toj6KMjzs0L7js3A2jqbn0yHrgR8c",
      "content": "Азиатские графические романы - манга, манхва и маньхуа, сумели покорить мир по ряду уникальных и заметных причин:<br/>Разнообразие жанров и тематик: Одной из ключевых причин популярности азиатских графических романов является их обширное разнообразие жанров и тематик. От романтики и приключений до научной фантастики и ужасов, азиатские графические романы позволяют читателям выбирать именно то, что соответствует их интересам и настроению.<br/>Глубокие персонажи и сюжеты: Характерные для азиатских графических романов сложные персонажи и глубокие сюжеты способны вовлечь читателя в эмоциональный опыт. Отношения между персонажами, их развитие и эволюция, а также общие жизненные драмы делают романы более реалистичными и привлекательными.<br/>Визуальный аспект и стиль: Художественное оформление и визуальный стиль азиатских графических романов являются ещё одним ключевым фактором их привлекательности. Внимательно проработанные детали, выразительные лица персонажей и динамичные панели делают чтение более зрелищным и увлекательным.<br/>Мировая доступность: С развитием интернета и платформ для чтения онлайн, азиатские графические романы стали более доступными для глобальной аудитории. Онлайн-публикация позволяет читателям из разных стран получать доступ к новым и интересным работам и делиться своими впечатлениями с сообществом.<br/>Влияние аниме и дорам: Популярность азиатских анимационных сериалов (аниме) и дорам (корейских телесериалов) также способствовала интересу к графическим романам. Многие успешные азиатские аниме и дорамы являются адаптациями манги или манхвы, что побуждает фанатов искать оригинальные истории.<br/>Сочетание богатства жанров, глубины сюжетов, художественной проработки и доступности сделали азиатские графические романы значимым элементом глобальной поп-культуры, оказывая влияние на миллионы читателей по всему миру.",
      "published_at": "2077-01-21"
    },
    {
      "id": "008",
      "title": "Почему азиатские графические романы захватили мир?",
      "image_url": "https://fastly.picsum.photos/id/29/280/150.jpg?hmac=cJIDwAtGovzIyEPj0BKzpJDRw3IdTBQFJDDoX1myJlA",
      "content": "Азиатские графические романы - манга, манхва и маньхуа, сумели покорить мир по ряду уникальных и заметных причин:<br/>Разнообразие жанров и тематик: Одной из ключевых причин популярности азиатских графических романов является их обширное разнообразие жанров и тематик. От романтики и приключений до научной фантастики и ужасов, азиатские графические романы позволяют читателям выбирать именно то, что соответствует их интересам и настроению.<br/>Глубокие персонажи и сюжеты: Характерные для азиатских графических романов сложные персонажи и глубокие сюжеты способны вовлечь читателя в эмоциональный опыт. Отношения между персонажами, их развитие и эволюция, а также общие жизненные драмы делают романы более реалистичными и привлекательными.<br/>Визуальный аспект и стиль: Художественное оформление и визуальный стиль азиатских графических романов являются ещё одним ключевым фактором их привлекательности. Внимательно проработанные детали, выразительные лица персонажей и динамичные панели делают чтение более зрелищным и увлекательным.<br/>Мировая доступность: С развитием интернета и платформ для чтения онлайн, азиатские графические романы стали более доступными для глобальной аудитории. Онлайн-публикация позволяет читателям из разных стран получать доступ к новым и интересным работам и делиться своими впечатлениями с сообществом.<br/>Влияние аниме и дорам: Популярность азиатских анимационных сериалов (аниме) и дорам (корейских телесериалов) также способствовала интересу к графическим романам. Многие успешные азиатские аниме и дорамы являются адаптациями манги или манхвы, что побуждает фанатов искать оригинальные истории.<br/>Сочетание богатства жанров, глубины сюжетов, художественной проработки и доступности сделали азиатские графические романы значимым элементом глобальной поп-культуры, оказывая влияние на миллионы читателей по всему миру.",
      "published_at": "2077-03-02"
    },
    {
      "id": "009",
      "title": "Почему по манхвам начали снимать аниме?",
      "image_url": "https://fastly.picsum.photos/id/633/280/150.jpg?hmac=ZNntBzCJ7LbCdu2LkBRPGfXGBdp0SOgPgOZ7rWaUC0Q",
      "content": "Рост популярности манхвы (южнокорейских графических романов) привел к тому, что их начали успешно адаптировать в формат аниме (японские анимационные сериалы). Вот несколько причин, почему манхвы стали источником вдохновения для создания аниме:<br/>Увлекательные сюжеты и персонажи: Манхвы часто предлагают оригинальные и интересные сюжеты, а также глубокие и эмоционально насыщенные персонажи. Это делает их привлекательными и захватывающими источниками материала для аниме-адаптаций.<br/>Глобальный успех манхвы: Манхва стала популярной не только в Южной Корее, но и за её пределами. Влияние манхвы ощущается на мировой арене развлечений, и аниме-студии замечают интерес зрителей к этому контенту, что способствует созданию адаптаций.<br/>Уникальная культурная палитра: Манхвы могут предложить разнообразные истории и аспекты южнокорейской культуры, которые для аудитории за рубежом остаются интересными и новыми. Это добавляет новое измерение к миропониманию и расширяет аудиторию.<br/>Экономический аспект: Аниме-адаптации манхвы позволяют студиям и продюсерам использовать уже готовый сценарий и дизайн персонажей, что может быть более экономичным в сравнении с созданием аниме с нуля.<br/>Взаимодействие между культурами: Аниме и манхва имеют множество общих черт и структурных аспектов, так как оба жанра происходят из азиатской культуры. Это создает основу для взаимодействия и взаимопонимания между аниме-фанатами и теми, кто интересуется манхвой.<br/>Таким образом, успех манхвы как источника материала для аниме-адаптаций обусловлен интересными сюжетами, уникальной культурной сущностью и глобальной популярностью, делая этот подход востребованным и приносящим результаты.",
      "published_at": "2077-06-01"
    }
  ],
  "comments": []
}